In [131]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os

In [132]:
data=pd.read_csv('titanic.csv')

In [133]:
data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [134]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)

In [135]:
data.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [136]:
dummies=pd.get_dummies(data.Sex)

In [137]:
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [138]:
data=pd.concat([data,dummies],axis=1)

In [139]:
data

     Pclass     Sex   Age     Fare  Survived  female  male
0         3    male  22.0   7.2500         0       0     1
1         1  female  38.0  71.2833         1       1     0
2         3  female  26.0   7.9250         1       1     0
3         1  female  35.0  53.1000         1       1     0
4         3    male  35.0   8.0500         0       0     1
..      ...     ...   ...      ...       ...     ...   ...
886       2    male  27.0  13.0000         0       0     1
887       1  female  19.0  30.0000         1       1     0
888       3  female   NaN  23.4500         0       1     0
889       1    male  26.0  30.0000         1       0     1
890       3    male  32.0   7.7500         0       0     1

[891 rows x 7 columns]

In [140]:
data.drop(['Sex'],axis=1,inplace=True)

In [141]:
data.head()

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1

In [142]:
data.isna().sum()

Pclass        0
Age         177
Fare          0
Survived      0
female        0
male          0
dtype: int64

In [143]:
data.Age=data.Age.fillna(data.Age.mean())

In [144]:
data.isnull().any()

Pclass      False
Age         False
Fare        False
Survived    False
female      False
male        False
dtype: bool

In [145]:
data.head()

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1

In [146]:
features=data.drop(['Survived'],axis=1)
target=data['Survived']

In [147]:
features.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [148]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [149]:
from sklearn.model_selection import train_test_split

In [150]:
x_train,x_test,y_train,y_test=train_test_split(features,target,test_size=0.2)

In [151]:
len(x_train)

712

In [152]:
len(x_test)

179

In [153]:
from sklearn.naive_bayes import GaussianNB

In [154]:
model=GaussianNB()

In [155]:
model.fit(x_train,y_train)

GaussianNB()

In [156]:
model.predict(x_test)

array([0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0,
       0, 1, 0], dtype=int64)

In [157]:
model.score(x_test,y_test)

0.8156424581005587